{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### A2. Буфер (Сложная версия)\n",
    "ограничение по времени на тест 1 секунда  \n",
    "ограничение по памяти на тест 256 мегабайт  \n",
    "\n",
    "Команда Почты тестирует целесообразность использования буфера для обработки писем пользователей, размер которого m байт.\n",
    "\n",
    "Для тестирования используется выборка из n последовательных писем пользователей, i-е из которых имеет размер $a_i$ байт. Алгоритм тестирования буфера следующий: в рамках одного теста, из выборки выбираются несколько писем с последовательными номерами, а затем происходит проверка, помещаются ли все письма из этой последовательности в буфер или нет. Таких тестов необходимо сделать как можно больше.\n",
    "\n",
    "Алгоритм не выглядит оптимальным, поэтому вам предлагается оптимизировать его. Требуется узнать, для скольких последовательностей писем из тестовой выборки суммарный размер хотя бы m байт.\n",
    "\n",
    "В данной версии задачи другие ограничения на n и m. Учтите, что ответ может не поместиться в 32-битный тип данных.\n",
    "\n",
    "Входные данные\n",
    "В первой строке даны два целых числа n и m — число писем в выборке и размер буфера ($1≤n≤10^5$, $1≤m≤10^{10}$).\n",
    "\n",
    "Во второй строке даны размеры писем $a_1$,$a_2$…$a_n$ ($1≤a_i≤10^5$).\n",
    "\n",
    "Выходные данные\n",
    "Выведите одно число — количество последовательностей писем из тестовой выборки, суммарный размер которых хотя бы m байт."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 10\n",
      "6 1 2 7\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "'''\n",
    "1. Суммирую элементы входной последовательности (размеры писем), начиная с первого, пока не достигну размера буфера.\n",
    "2. Засчитываю полученную последовательность в счетчик, а так же прибавляю туда же количество оставшихся до конца \n",
    "последовательности элементов (т.к. суммируя с ними также будут получаться подходящие последовательности)\n",
    "3. Отнимаю от накопленной суммы элементы из начала этой последовательности, пока сумма не станет меньше размера буфера.\n",
    "И так до конца строки\n",
    "'''\n",
    "n, m = map(int, input().split())\n",
    "seq_str = input().split()\n",
    "seq = [int(x) for x in seq_str]\n",
    "s = 0\n",
    "qty = 0\n",
    "ind_begin = 0\n",
    "for i in range(n):\n",
    "    s += seq[i]\n",
    "    while s >= m:\n",
    "        qty += n - i\n",
    "        s -= seq[ind_begin]\n",
    "        ind_begin += 1\n",
    "print(qty)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
