{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### E2. Спекулянт (Сложная версия)\n",
    "ограничение по времени на тест 3 секунды  \n",
    "ограничение по памяти на тест 512 мегабайт  \n",
    "\n",
    "Сервис Юла работает в n городах и экспериментально предлагает бесплатную доставку между некоторыми городами. Всего есть m односторонних направлений бесплатной доставки из города с номером $a_i$ в город с номером $b_i$.\n",
    "\n",
    "Вася хочет заработать на перепродаже игровой консоли GameLocation 6. Для каждого города известна стоимость консоли в нем. Вася хочет купить консоль в одном городе, продать ее в другом городе и заработать как можно больше денег. Вася может купить консоль в любом городе, но при этом он готов пользоваться только бесплатной доставкой — возможно, более одного раза.\n",
    "\n",
    "Оцените максимальный возможный заработок Васи, равный разности цены продажи и цены покупки, в рамках этого гениального плана.\n",
    "\n",
    "Обратите внимание, что ответ может быть отрицательным (смотрите тесты в примере).\n",
    "\n",
    "В данной версии задачи нет условия для каждого направления $a_i$<$b_i$.\n",
    "\n",
    "Входные данные\n",
    "В первой строке даны два целых целых числа n и m — число городов и направлений бесплатной доставки ($2≤n≤2⋅10^5$, $1≤m≤2⋅10^5$).\n",
    "\n",
    "Во второй строке заданы n чисел $p_1$,$p_2$,…,$p_n$ — стоимости игровой консоли GameLocation 6 в каждом городе ($1≤p_i≤10^9$).\n",
    "\n",
    "Далее в m строках содержатся по два целых числа ai,bi, которые означают, что можно бесплатно отправить посылку из города с номером $a_i$ в город с номером bi. ($1≤a_i$,$b_i≤n$, $a_i≠b_i$). Гарантируется, что все направления бесплатной доставки различны.\n",
    "\n",
    "Выходные данные\n",
    "Выведите максимальный возможный заработок Васи."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 3\n",
      "2 3 1 5\n",
      "2 4\n",
      "1 2\n",
      "1 3\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "n, m = map(int, input().split())\n",
    "p_in = input().split()\n",
    "\n",
    "p = [int(x) for x in p_in]\n",
    "p_more = [x for x in p] # цена, доступная из данной точки по бесплатным доставкам (по путям доставки буду протаскивать выгодные цены)\n",
    "free_p = [[0,0,0] for i in range(m)]\n",
    "diff_max = None\n",
    "for i in range(m):\n",
    "    free_p[i][0], free_p[i][1] = map(int, input().split())\n",
    "    free_p[i][2] = p[free_p[i][1]-1]\n",
    "\n",
    "free_p = sorted(free_p, key = lambda x: x[2], reverse = True) # перетягивать цены в p_more нужно начиная с максимальной цены\n",
    "for i in range(m):\n",
    "    fr = free_p[i][0]-1\n",
    "    to = free_p[i][1]-1\n",
    "    if p_more[to] > p_more[fr]:\n",
    "        p_more[fr] = p_more[to] # если в данной точке по доставкам доступна бОльшая, то \"перетягиваю\" эту цену в данную точку \n",
    "for i in range(m):\n",
    "    diff = p_more[free_p[i][1]-1] - p[free_p[i][0]-1]\n",
    "    if diff_max is None or diff > diff_max:\n",
    "        diff_max = diff\n",
    "print(diff_max)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
