{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### F2. Радиус поиска (Средняя версия)\n",
    "ограничение по времени на тест 4 секунды  \n",
    "ограничение по памяти на тест 512 мегабайт\n",
    "\n",
    "Ситимобил хочет научиться подсказывать водителям оптимальное место для поиска заказов. По последней тенденции чаще всего такси вызывают не на середину улицы, а на некоторый перекресток.\n",
    "\n",
    "Представим город как бесконечную координатную плоскость, каждая целочисленная прямая которой является улицей. Тогда точки с целочисленными координатами являются перекрестками.\n",
    "\n",
    "Водителю направляются заказы, евклидово расстояние до которых не превосходит r. Если водитель припарковался в точке (x, y), он хочет знать сколько перекрестков находится в его радиусе поиска.\n",
    "\n",
    "Вам дана тройка чисел x, y и r, определите ответ.\n",
    "\n",
    "Обратите внимание, что в этой версии задачи другие ограничения на входные данные.\n",
    "\n",
    "Входные данные\n",
    "Единственная строка содержит три целых числа x, y и r ($−10^5≤x$,$y≤10^5$, $0<r≤10^5$).\n",
    "\n",
    "Выходные данные\n",
    "Выведите число перекрестков в радиусе поиска водителя."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 0 5\n",
      "81\n"
     ]
    }
   ],
   "source": [
    "x0, y0, r = map(int, input().split())\n",
    "s = 0\n",
    "x = 1\n",
    "for ym in range(r+1):\n",
    "    y = r - ym\n",
    "    if y == r:\n",
    "        s += r\n",
    "        continue\n",
    "    dist = (x**2+y**2)**(1/2)\n",
    "    while dist <= r:\n",
    "        s += y+1\n",
    "        x += 1\n",
    "        dist = (x**2+y**2)**(1/2)\n",
    "print(4*s + 1 -r*4)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
